diplom-src/src/DataProcessors/ВКМ_ЗаполнитьГрафик/ВКМ_ЗаполнитьГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнитьГрафик</name>
</mdclass:DataProcessor>

diplom-src/src/InformationRegisters/ВКМ_РабочийГрафик/ВКМ_РабочийГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_РабочийГрафик</name>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/DataProcessors/ВКМ_ЗаполнитьГрафик/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_РабочийГрафик.СоздатьНаборЗаписей();
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.РабочийДень = 0;
			Иначе	          
				Запись.РабочийДень = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.РабочийДень = 0;
				Иначе	          
					НоваяЗапись.РабочийДень = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.РабочийДень = 0;
				Иначе	          
					Запись.РабочийДень = 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.РабочийДень = 0;
		Иначе	          
			Запись.РабочийДень = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
